In [1]:
# importing library
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df = pd.read_csv('online.csv')

In [4]:
df.head(5)

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [6]:
df.shape

(50, 5)

In [7]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# separate x,y

In [10]:
x = df.drop(['Profit'], axis=1)
y = df['Profit']

In [12]:
y

0     192261.83
1     191792.06
2     191050.39
3     182901.99
4     166187.94
5     156991.12
6     156122.51
7     155752.60
8     152211.77
9     149759.96
10    146121.95
11    144259.40
12    141585.52
13    134307.35
14    132602.65
15    129917.04
16    126992.93
17    125370.37
18    124266.90
19    122776.86
20    118474.03
21    111313.02
22    110352.25
23    108733.99
24    108552.04
25    107404.34
26    105733.54
27    105008.31
28    103282.38
29    101004.64
30     99937.59
31     97483.56
32     97427.84
33     96778.92
34     96712.80
35     96479.51
36     90708.19
37     89949.14
38     81229.06
39     81005.76
40     78239.91
41     77798.83
42     71498.49
43     69758.98
44     65200.33
45     64926.08
46     49490.75
47     42559.73
48     35673.41
49     14681.40
Name: Profit, dtype: float64

# one hot encoding

In [28]:
city = pd.get_dummies(x['Area'],drop_first=True)

In [29]:
city.head(5)

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [30]:
x = x.drop(['Area'], axis=1)

In [32]:
x.head(5)

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [33]:
x = pd.concat([x, city], axis=1)

In [34]:
x.head(5)

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1

In [20]:
final = merged.drop(['Area'],axis=1)

In [21]:
final.head(5)

   Marketing Spend  Administration  Transport     Profit  Ctg  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83    0      1        0
1        162597.70       151377.59  443898.53  191792.06    1      0        0
2        153441.51       101145.55  407934.54  191050.39    0      0        1
3        144372.41       118671.85  383199.62  182901.99    0      1        0
4        142107.34        91391.77  366168.42  166187.94    0      0        1

 # Train And Test Data Split

In [35]:
from sklearn.model_selection import train_test_split

In [36]:
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size=.25, random_state=0)

In [38]:
xtrain.head(5)

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
34         46426.07       157693.92  210797.67      0        0
18         91749.16       114175.79  294919.57      0        1
7         130298.13       145530.06  323876.68      0        1
14        119943.24       156547.42  256512.92      0        1
45          1000.23       124153.04    1903.93      1        0

# Training

In [40]:
from sklearn.linear_model import LinearRegression

In [43]:
regressor = LinearRegression()

In [44]:
regressor.fit(xtrain, ytrain)

LinearRegression()

In [45]:
ytest

28    103282.38
11    144259.40
10    146121.95
41     77798.83
2     191050.39
27    105008.31
38     81229.06
31     97483.56
22    110352.25
4     166187.94
33     96778.92
35     96479.51
26    105733.54
Name: Profit, dtype: float64

In [47]:
pred = regressor.predict(xtest)
print(pred)

[103501.0825284  128011.28068627 126695.43891127  70573.91718775
 173381.96874259 124238.07860872  69298.09250304  98399.41936876
 116419.1480864  161430.98134847  94740.73303076  89920.22800514
 105956.86065332]

In [54]:
score = regressor.score(xtest,ytest)
print(score)

0.8840978623923469

# R-Squared Value

In [50]:
from sklearn.metrics import r2_score

In [57]:
score = r2_score(ytest,pred)
print(score*100,'%')

88.40978623923469 %